# Automatic configure script builder
brew "autoconf"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Software library to render fonts
brew "freetype"
# Curses-based interface to the GNU Debugger
brew "cgdb"
# Formatting tools for C, C++, Obj-C, Java, JavaScript, TypeScript
brew "clang-format"
# Cross-platform make
brew "cmake"
# TIFF library and utilities
brew "libtiff"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# GNU multiple precision arithmetic library
brew "gmp"
# OpenType text shaping engine
brew "harfbuzz"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# Improved top (interactive process viewer)
brew "htop"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Next-gen compiler infrastructure
brew "llvm"
# Utility for directing compilation
brew "make"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Manage multiple Node.js versions
brew "nvm"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Fast, disk space efficient package manager
brew "pnpm"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Vi 'workalike' with many additional features
brew "vim"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Web browser focusing on privacy
cask "brave-browser"
cask "font-fira-code"
cask "font-meslo-lg-nerd-font"
cask "font-sarasa-gothic"
# Web browser
cask "google-chrome"
# Desktop automation application
cask "hammerspoon"
# IDE for Java development - community edition
cask "intellij-idea-ce"
# Open-source keystroke visualiser
cask "keycastr"
# Team communication and collaboration software
cask "slack"
# Open-source code editor
cask "visual-studio-code"
# Network protocol analyzer
cask "wireshark-app"
vscode "dbaeumer.vscode-eslint"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.code-runner"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "justusadam.language-haskell"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpp-devtools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "twxs.cmake"
vscode "vadimcn.vscode-lldb"
